CFDEM/CFDEMcoupling/tutorials/cfdemSolverReactingRhoPimple/packedBedAdiabatic/CFD/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1.0;

xmin 	-0.0025;
xmax  	0.0025;
ymin 	-0.0025;
ymax  	0.0025;
zmin 	0.0;
zmax  	0.02;

vertices
(
    ($xmin $ymin $zmin)
    ($xmax $ymin $zmin)
    ($xmax $ymax $zmin)
    ($xmin $ymax $zmin)
    ($xmin $ymin $zmax)
    ($xmax $ymin $zmax)
    ($xmax $ymax $zmax)
    ($xmin $ymax $zmax)

);

blocks
(
    hex (0 1 2  3 4 5 6 7) (5 5 20) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    walls
    {
        type wall;
        faces
        ( 
            (0 4 7 3)
            (1 5 4 0)
            (3 7 6 2)
            (2 6 5 1)
        );
    }
    inlet
    {
        type patch;
        faces
        (            
            (0 3 2 1)
        );
    }
    outlet
    {
        type patch;
        faces
        (            
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
