CFDEM/CFDEMcoupling/tutorials/cfdemSolverReactingRhoPimple/packedBedAdiabatic/CFD/system/sample
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*\
Description
    Writes graph data for specified fields along a line, specified by start
    and end points.

\*---------------------------------------------------------------------------*/

type                sets;
libs                ("libsampling.so");

writeControl        writeTime;

interpolationScheme cellPointFace;
setFormat           csv;

sets
(
    line
    {
        type    lineCellFace;   
        axis    z;
        start   (0. 0. 0.);
        end     (0. 0. 0.02);
    }
);

fields  
(
    p
    T
    Ux
    Uy
    Uz
    voidfraction
    CH4
    O2
    C2H6
    C2H4
    CO2
    CO
);

// ************************************************************************* //
